# квадратное уровнение
a = int(input("Число а:"))
b = int(input("Число b:"))
c = int(input("Число c:"))

print(f'Формула: {a}*(x**2)+{b}*x+{c}')
print(f"Необходимо найти дискриминант по формуле: d = {b}**2 - 4*{a}*{c}")

d = b**2 - 4*a*c
if d==0:
    print("Если d == 0 будет 1 корень")
    print(f"Корень можно найти по формуле: х = -{b}/(2*{a})")
    х = -b/(2*a)
    print(f"Итог х == {x}")
else:
    print("Если d > 0 будет 2 корня")
    print(f"Формула: x1 = -{b} + ({d} * 0.5) / (2 * {a})")
    print(f"Формула: x1 = -{b} - ({d} * 0.5) / (2 * {a})")

    x1 = -b + (d * 0.5) / (2 * a)
    x2 = -b - (d * 0.5) / (2 * a)
    print(f"Итог х1 == {x1}")
    print(f"Итог х2 == {x2}")
